---
kind: type
id: T:Autodesk.Revit.DB.CurveNode
source: html/f46bbf24-04d0-a4c0-f694-adb30f3db8ea.htm
---
# Autodesk.Revit.DB.CurveNode

An output node that represents a model curve.

## Syntax (C#)
```csharp
public class CurveNode : ModelCurveNode
```

## Remarks
See also: OnCurve(CurveNode) .